<a href="https://colab.research.google.com/github/carlosestiben/PruebaGithub/blob/master/Entregable_2_dataframe_25%20filas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
#1. Crear un DataFrame, con el fin de organizar y visualizar los datos de manera estructurada

data = {'Name': ['Camila', 'Camila', 'Laura', 'Jorge', 'Andres', 'Diana', 'Fernando', 'Maria', 'Carlos', 'Sara',
             'Sofia', 'David', 'Sebastian', 'Pedro', 'Sara', 'Sara', 'Natalia', 'Diana', 'Diana', 'Ana',
             'Ricardo', 'Sara', 'Alejandra', 'Jorge', 'Luis'],
    'Age': [37, 32, 29, 30, 34, 36, 35, 27, 34, 29, 33, 39, 25, 26, 27, 22, 34, 23, 26, 30, 36, 39, 30, 34, 25],
    'City': ['Manizales', 'Bucaramanga', 'Cali', 'Pereira', 'Cartagena', 'Manizales', 'Bogota', 'Cali', 'Cali',
             'Manizales', 'Ibague', 'Ibague', 'Manizales', 'Manizales', 'Cucuta', 'Manizales', 'Pereira',
             'Medellin', 'Cucuta', 'Bucaramanga', 'Cartagena', 'Manizales', 'Medellin', 'Ibague', 'Bogota'],
    'University': ['Ces', 'Ces', 'UdeA', 'UdeA', 'Ces', 'Nacional', 'UdeA', 'Ces', 'UdeA', 'Nacional', 'UdeA',
                   'Nacional', 'UdeA', 'UdeA', 'Ces', 'Ces', 'UdeA', 'Ces', 'Nacional', 'Nacional', 'Ces',
                   'Nacional', 'UdeA', 'Nacional', 'Ces'],
    'Salary': [7552.15, 7460.06, 2558.54, 4323.34, 2550.71, 6018.55, 7729.07, 5940.13, 3606.97, 5459.69,
               4041.85, 7629.15, 4358.51, 4009.8, 3418.66, 7405.46, 5854.22, 2774.18, 5145.43, 3905.48,
               5488.91, 5163.84, 2991.96, 2829.07, 6144.52]}

df = pd.DataFrame(data)
print(df)

         Name  Age         City University   Salary
0      Camila   37    Manizales        Ces  7552.15
1      Camila   32  Bucaramanga        Ces  7460.06
2       Laura   29         Cali       UdeA  2558.54
3       Jorge   30      Pereira       UdeA  4323.34
4      Andres   34    Cartagena        Ces  2550.71
5       Diana   36    Manizales   Nacional  6018.55
6    Fernando   35       Bogota       UdeA  7729.07
7       Maria   27         Cali        Ces  5940.13
8      Carlos   34         Cali       UdeA  3606.97
9        Sara   29    Manizales   Nacional  5459.69
10      Sofia   33       Ibague       UdeA  4041.85
11      David   39       Ibague   Nacional  7629.15
12  Sebastian   25    Manizales       UdeA  4358.51
13      Pedro   26    Manizales       UdeA  4009.80
14       Sara   27       Cucuta        Ces  3418.66
15       Sara   22    Manizales        Ces  7405.46
16    Natalia   34      Pereira       UdeA  5854.22
17      Diana   23     Medellin        Ces  2774.18
18      Diana   26       Cucuta   Nacional  5145.43
19        Ana   30  Bucaramanga   Nacional  3905.48
20    Ricardo   36    Cartagena        Ces  5488.91
21       Sara   39    Manizales   Nacional  5163.84
22  Alejandra   30     Medellin       UdeA  2991.96
23      Jorge   34       Ibague   Nacional  2829.07
24       Luis   25       Bogota        Ces  6144.52

In [ ]:
#2. Seleccionar una columna del DataFrame para tener una vista rapida de datos especificos
print(df['Name'])

0        Camila
1        Camila
2         Laura
3         Jorge
4        Andres
5         Diana
6      Fernando
7         Maria
8        Carlos
9          Sara
10        Sofia
11        David
12    Sebastian
13        Pedro
14         Sara
15         Sara
16      Natalia
17        Diana
18        Diana
19          Ana
20      Ricardo
21         Sara
22    Alejandra
23        Jorge
24         Luis
Name: Name, dtype: object

In [ ]:
#3. Seleccionar fila con loc y asignar valores por etiquetas
df['Category'] = df['Salary'].apply(lambda x: 'Executive' if x >= 5000 else 'operator')

print(df.loc[df['Category'] == 'Executive'])

        Name  Age         City University   Salary   Category
0     Camila   37    Manizales        Ces  7552.15  Executive
1     Camila   32  Bucaramanga        Ces  7460.06  Executive
5      Diana   36    Manizales   Nacional  6018.55  Executive
6   Fernando   35       Bogota       UdeA  7729.07  Executive
7      Maria   27         Cali        Ces  5940.13  Executive
9       Sara   29    Manizales   Nacional  5459.69  Executive
11     David   39       Ibague   Nacional  7629.15  Executive
15      Sara   22    Manizales        Ces  7405.46  Executive
16   Natalia   34      Pereira       UdeA  5854.22  Executive
18     Diana   26       Cucuta   Nacional  5145.43  Executive
20   Ricardo   36    Cartagena        Ces  5488.91  Executive
21      Sara   39    Manizales   Nacional  5163.84  Executive
24      Luis   25       Bogota        Ces  6144.52  Executive

In [ ]:
df['Category'] = df['Salary'].apply(lambda x: 'Executive' if x >= 5000 else 'operator')

print(df.loc[df['Category'] == 'operator'])

         Name  Age         City University   Salary  Category
2       Laura   29         Cali       UdeA  2558.54  operator
3       Jorge   30      Pereira       UdeA  4323.34  operator
4      Andres   34    Cartagena        Ces  2550.71  operator
8      Carlos   34         Cali       UdeA  3606.97  operator
10      Sofia   33       Ibague       UdeA  4041.85  operator
12  Sebastian   25    Manizales       UdeA  4358.51  operator
13      Pedro   26    Manizales       UdeA  4009.80  operator
14       Sara   27       Cucuta        Ces  3418.66  operator
17      Diana   23     Medellin        Ces  2774.18  operator
19        Ana   30  Bucaramanga   Nacional  3905.48  operator
22  Alejandra   30     Medellin       UdeA  2991.96  operator
23      Jorge   34       Ibague   Nacional  2829.07  operator

In [ ]:
#4. Filtrar datos, para visualizar el subconjuto especifico UdeA de la columna universidad
Best_University= df[df['University']=='UdeA']
print(Best_University)

         Name  Age       City University   Salary   Category
2       Laura   29       Cali       UdeA  2558.54   operator
3       Jorge   30    Pereira       UdeA  4323.34   operator
6    Fernando   35     Bogota       UdeA  7729.07  Executive
8      Carlos   34       Cali       UdeA  3606.97   operator
10      Sofia   33     Ibague       UdeA  4041.85   operator
12  Sebastian   25  Manizales       UdeA  4358.51   operator
13      Pedro   26  Manizales       UdeA  4009.80   operator
16    Natalia   34    Pereira       UdeA  5854.22  Executive
22  Alejandra   30   Medellin       UdeA  2991.96   operator

In [ ]:
#5. Estadistica descriptiva
print(df.describe())

             Age       Salary
count  25.000000    25.000000
mean   30.880000  4974.410000
std     4.918672  1722.655232
min    22.000000  2550.710000
25%    27.000000  3606.970000
50%    30.000000  5145.430000
75%    34.000000  6018.550000
max    39.000000  7729.070000

In [ ]:
#6. Eliminar columnas
df = df.drop('Category', axis=1)
print(df)

         Name  Age         City University   Salary
0      Camila   37    Manizales        Ces  7552.15
1      Camila   32  Bucaramanga        Ces  7460.06
2       Laura   29         Cali       UdeA  2558.54
3       Jorge   30      Pereira       UdeA  4323.34
4      Andres   34    Cartagena        Ces  2550.71
5       Diana   36    Manizales   Nacional  6018.55
6    Fernando   35       Bogota       UdeA  7729.07
7       Maria   27         Cali        Ces  5940.13
8      Carlos   34         Cali       UdeA  3606.97
9        Sara   29    Manizales   Nacional  5459.69
10      Sofia   33       Ibague       UdeA  4041.85
11      David   39       Ibague   Nacional  7629.15
12  Sebastian   25    Manizales       UdeA  4358.51
13      Pedro   26    Manizales       UdeA  4009.80
14       Sara   27       Cucuta        Ces  3418.66
15       Sara   22    Manizales        Ces  7405.46
16    Natalia   34      Pereira       UdeA  5854.22
17      Diana   23     Medellin        Ces  2774.18
18      Diana   26       Cucuta   Nacional  5145.43
19        Ana   30  Bucaramanga   Nacional  3905.48
20    Ricardo   36    Cartagena        Ces  5488.91
21       Sara   39    Manizales   Nacional  5163.84
22  Alejandra   30     Medellin       UdeA  2991.96
23      Jorge   34       Ibague   Nacional  2829.07
24       Luis   25       Bogota        Ces  6144.52

In [ ]:
#7. Agregar nuevas columnas
df['Currency'] = 'USD'
print(df)

         Name  Age         City University   Salary Currency
0      Camila   37    Manizales        Ces  7552.15      USD
1      Camila   32  Bucaramanga        Ces  7460.06      USD
2       Laura   29         Cali       UdeA  2558.54      USD
3       Jorge   30      Pereira       UdeA  4323.34      USD
4      Andres   34    Cartagena        Ces  2550.71      USD
5       Diana   36    Manizales   Nacional  6018.55      USD
6    Fernando   35       Bogota       UdeA  7729.07      USD
7       Maria   27         Cali        Ces  5940.13      USD
8      Carlos   34         Cali       UdeA  3606.97      USD
9        Sara   29    Manizales   Nacional  5459.69      USD
10      Sofia   33       Ibague       UdeA  4041.85      USD
11      David   39       Ibague   Nacional  7629.15      USD
12  Sebastian   25    Manizales       UdeA  4358.51      USD
13      Pedro   26    Manizales       UdeA  4009.80      USD
14       Sara   27       Cucuta        Ces  3418.66      USD
15       Sara   22    Manizales        Ces  7405.46      USD
16    Natalia   34      Pereira       UdeA  5854.22      USD
17      Diana   23     Medellin        Ces  2774.18      USD
18      Diana   26       Cucuta   Nacional  5145.43      USD
19        Ana   30  Bucaramanga   Nacional  3905.48      USD
20    Ricardo   36    Cartagena        Ces  5488.91      USD
21       Sara   39    Manizales   Nacional  5163.84      USD
22  Alejandra   30     Medellin       UdeA  2991.96      USD
23      Jorge   34       Ibague   Nacional  2829.07      USD
24       Luis   25       Bogota        Ces  6144.52      USD

In [ ]:
#8. Operaciones con las columnas
df['security'] = df['Salary'] * 0.04
print(df)

         Name  Age         City University   Salary Currency  security
0      Camila   37    Manizales        Ces  7552.15      USD  302.0860
1      Camila   32  Bucaramanga        Ces  7460.06      USD  298.4024
2       Laura   29         Cali       UdeA  2558.54      USD  102.3416
3       Jorge   30      Pereira       UdeA  4323.34      USD  172.9336
4      Andres   34    Cartagena        Ces  2550.71      USD  102.0284
5       Diana   36    Manizales   Nacional  6018.55      USD  240.7420
6    Fernando   35       Bogota       UdeA  7729.07      USD  309.1628
7       Maria   27         Cali        Ces  5940.13      USD  237.6052
8      Carlos   34         Cali       UdeA  3606.97      USD  144.2788
9        Sara   29    Manizales   Nacional  5459.69      USD  218.3876
10      Sofia   33       Ibague       UdeA  4041.85      USD  161.6740
11      David   39       Ibague   Nacional  7629.15      USD  305.1660
12  Sebastian   25    Manizales       UdeA  4358.51      USD  174.3404
13      Pedro   26    Manizales       UdeA  4009.80      USD  160.3920
14       Sara   27       Cucuta        Ces  3418.66      USD  136.7464
15       Sara   22    Manizales        Ces  7405.46      USD  296.2184
16    Natalia   34      Pereira       UdeA  5854.22      USD  234.1688
17      Diana   23     Medellin        Ces  2774.18      USD  110.9672
18      Diana   26       Cucuta   Nacional  5145.43      USD  205.8172
19        Ana   30  Bucaramanga   Nacional  3905.48      USD  156.2192
20    Ricardo   36    Cartagena        Ces  5488.91      USD  219.5564
21       Sara   39    Manizales   Nacional  5163.84      USD  206.5536
22  Alejandra   30     Medellin       UdeA  2991.96      USD  119.6784
23      Jorge   34       Ibague   Nacional  2829.07      USD  113.1628
24       Luis   25       Bogota        Ces  6144.52      USD  245.7808

In [ ]:
#9. Agrupar datos
grouped = df.groupby('University')['Salary'].mean()
print(grouped)

University
Ces         5414.975556
Nacional    5164.458571
UdeA        4386.028889
Name: Salary, dtype: float64

In [ ]:
#10. Ordenar datos
df_sorted = df.sort_values(by='Salary', ascending=True)
print(df_sorted)

         Name  Age         City University   Salary Currency  security
4      Andres   34    Cartagena        Ces  2550.71      USD  102.0284
2       Laura   29         Cali       UdeA  2558.54      USD  102.3416
17      Diana   23     Medellin        Ces  2774.18      USD  110.9672
23      Jorge   34       Ibague   Nacional  2829.07      USD  113.1628
22  Alejandra   30     Medellin       UdeA  2991.96      USD  119.6784
14       Sara   27       Cucuta        Ces  3418.66      USD  136.7464
8      Carlos   34         Cali       UdeA  3606.97      USD  144.2788
19        Ana   30  Bucaramanga   Nacional  3905.48      USD  156.2192
13      Pedro   26    Manizales       UdeA  4009.80      USD  160.3920
10      Sofia   33       Ibague       UdeA  4041.85      USD  161.6740
3       Jorge   30      Pereira       UdeA  4323.34      USD  172.9336
12  Sebastian   25    Manizales       UdeA  4358.51      USD  174.3404
18      Diana   26       Cucuta   Nacional  5145.43      USD  205.8172
21       Sara   39    Manizales   Nacional  5163.84      USD  206.5536
9        Sara   29    Manizales   Nacional  5459.69      USD  218.3876
20    Ricardo   36    Cartagena        Ces  5488.91      USD  219.5564
16    Natalia   34      Pereira       UdeA  5854.22      USD  234.1688
7       Maria   27         Cali        Ces  5940.13      USD  237.6052
5       Diana   36    Manizales   Nacional  6018.55      USD  240.7420
24       Luis   25       Bogota        Ces  6144.52      USD  245.7808
15       Sara   22    Manizales        Ces  7405.46      USD  296.2184
1      Camila   32  Bucaramanga        Ces  7460.06      USD  298.4024
0      Camila   37    Manizales        Ces  7552.15      USD  302.0860
11      David   39       Ibague   Nacional  7629.15      USD  305.1660
6    Fernando   35       Bogota       UdeA  7729.07      USD  309.1628

In [ ]:
#11. Cambiar el nombre de las columnas
df.rename(columns={'Name': 'Fist Name', 'University': 'Alma mater'}, inplace=True)
print(df)

    Fist Name  Age         City Alma mater   Salary Currency  security
0      Camila   37    Manizales        Ces  7552.15      USD  302.0860
1      Camila   32  Bucaramanga        Ces  7460.06      USD  298.4024
2       Laura   29         Cali       UdeA  2558.54      USD  102.3416
3       Jorge   30      Pereira       UdeA  4323.34      USD  172.9336
4      Andres   34    Cartagena        Ces  2550.71      USD  102.0284
5       Diana   36    Manizales   Nacional  6018.55      USD  240.7420
6    Fernando   35       Bogota       UdeA  7729.07      USD  309.1628
7       Maria   27         Cali        Ces  5940.13      USD  237.6052
8      Carlos   34         Cali       UdeA  3606.97      USD  144.2788
9        Sara   29    Manizales   Nacional  5459.69      USD  218.3876
10      Sofia   33       Ibague       UdeA  4041.85      USD  161.6740
11      David   39       Ibague   Nacional  7629.15      USD  305.1660
12  Sebastian   25    Manizales       UdeA  4358.51      USD  174.3404
13      Pedro   26    Manizales       UdeA  4009.80      USD  160.3920
14       Sara   27       Cucuta        Ces  3418.66      USD  136.7464
15       Sara   22    Manizales        Ces  7405.46      USD  296.2184
16    Natalia   34      Pereira       UdeA  5854.22      USD  234.1688
17      Diana   23     Medellin        Ces  2774.18      USD  110.9672
18      Diana   26       Cucuta   Nacional  5145.43      USD  205.8172
19        Ana   30  Bucaramanga   Nacional  3905.48      USD  156.2192
20    Ricardo   36    Cartagena        Ces  5488.91      USD  219.5564
21       Sara   39    Manizales   Nacional  5163.84      USD  206.5536
22  Alejandra   30     Medellin       UdeA  2991.96      USD  119.6784
23      Jorge   34       Ibague   Nacional  2829.07      USD  113.1628
24       Luis   25       Bogota        Ces  6144.52      USD  245.7808

In [ ]:
#12. Buscar valores especificos

print(df[df['City'] == 'Manizales'])

    Fist Name  Age       City Alma mater   Salary Currency  security
0      Camila   37  Manizales        Ces  7552.15      USD  302.0860
5       Diana   36  Manizales   Nacional  6018.55      USD  240.7420
9        Sara   29  Manizales   Nacional  5459.69      USD  218.3876
12  Sebastian   25  Manizales       UdeA  4358.51      USD  174.3404
13      Pedro   26  Manizales       UdeA  4009.80      USD  160.3920
15       Sara   22  Manizales        Ces  7405.46      USD  296.2184
21       Sara   39  Manizales   Nacional  5163.84      USD  206.5536